var i = {
    "浙江" : {
        id : "1",
        subAreas : {
            "杭州" : {
                id : "1.1",
                subAreas : {
                    "滨江" : {
                        id : "1.1.1"
                    },
                    "上城区" : {
                        id : "1.1.2"
                    }
                }
            },
            "温州" : {
                id : "1.2",
                subAreas : {
                    "温州某县" : {
                        id : "1.2.1"
                    }
                }
            }
        }
    },
    "湖南" : {
        id : "1",
        subAreas : {
            "长沙" : {
                id : "1.1",
                subAreas : {
                    "长沙某县1" : {
                        id : "1.1.1"
                    },
                    "长沙某县2" : {
                        id : "1.1.2"
                    }
                }
            },
            "湘潭" : {
                id : "1.2",
                subAreas : {
                    "湘潭某县" : {
                        id : "1.2.1"
                    }
                }
            }
        }
    }
};